# Pivot and Pivot table
----------
## Pivot :
Pivot allows you reshape or trandform your dataset.

In the city column there are three different cities new york, mumbai and beijing. Every city has a temperature
and humidity in three different months. If you want to transform you dataset into another shape table so that you
you can better analyze data,here comes the use of pivot.

In [1]:
import pandas as pd

In [2]:
mydis={
    'Date':['5/1/2017','5/2/2017','5/3/2017','5/1/2017','5/2/2017','5/3/2017','5/1/2017','5/2/2017','5/3/2017'],
    'city':['new york','new york','new york','mumbai','mumbai','mumbai','beijing','beijing','beijing'],
    'temp':[65,66,68,75,78,82,80,77,79],
'humidity':[56,58,60,80,83,85,26,30,35]
}
df=pd.DataFrame(mydis)
df

       Date      city  temp  humidity
0  5/1/2017  new york    65        56
1  5/2/2017  new york    66        58
2  5/3/2017  new york    68        60
3  5/1/2017    mumbai    75        80
4  5/2/2017    mumbai    78        83
5  5/3/2017    mumbai    82        85
6  5/1/2017   beijing    80        26
7  5/2/2017   beijing    77        30
8  5/3/2017   beijing    79        35

To reshape your dataframe into another form you need to pass you arguments one is index="row" ("row" is the row
which you want to be row of transformed dataframe) and another argument is column="col" ("col" is the column you want
to be the column of the transformed dataframe).

In [3]:
df.pivot(index='Date',columns='city')

            temp                 humidity
city     beijing mumbai new york  beijing mumbai new york
Date
5/1/2017      80     75       65       26     80       56
5/2/2017      77     78       66       30     83       58
5/3/2017      79     82       68       35     85       60

In [4]:
df.pivot(index='city',columns='Date')

             temp                   humidity
Date     5/1/2017 5/2/2017 5/3/2017 5/1/2017 5/2/2017 5/3/2017
city
beijing        80       77       79       26       30       35
mumbai         75       78       82       80       83       85
new york       65       66       68       56       58       60

In [5]:
#depending on the index, we might end up with missing values, which are set to NaN by default
df.pivot(index='temp',columns='Date')

          city                     humidity
Date  5/1/2017  5/2/2017  5/3/2017 5/1/2017 5/2/2017 5/3/2017
temp
65    new york       NaN       NaN     56.0      NaN      NaN
66         NaN  new york       NaN      NaN     58.0      NaN
68         NaN       NaN  new york      NaN      NaN     60.0
75      mumbai       NaN       NaN     80.0      NaN      NaN
77         NaN   beijing       NaN      NaN     30.0      NaN
78         NaN    mumbai       NaN      NaN     83.0      NaN
79         NaN       NaN   beijing      NaN      NaN     35.0
80     beijing       NaN       NaN     26.0      NaN      NaN
82         NaN       NaN    mumbai      NaN      NaN     85.0

## Pivot Table
Pivot table is used to summarize and aggregate data inside dataframe.

In [6]:
mydis={
    'Date':['5/1/2017','5/1/2017','5/2/2017','5/2/2017','5/1/2017','5/1/2017','5/2/2017','5/2/2017','5/1/2017',
            '5/1/2017','5/2/2017','5/2/2017'],
    'city':['new york','new york','new york','new york','mumbai','mumbai','mumbai','mumbai','beijing','beijing',
            'beijing','beijing'],
    'temp':[65,66,68,69,75,78,82,81,80,77,79,86],
'humidity':[56,58,60,50,80,83,85,78,26,30,35,78]
}
df=pd.DataFrame(mydis)
df

        Date      city  temp  humidity
0   5/1/2017  new york    65        56
1   5/1/2017  new york    66        58
2   5/2/2017  new york    68        60
3   5/2/2017  new york    69        50
4   5/1/2017    mumbai    75        80
5   5/1/2017    mumbai    78        83
6   5/2/2017    mumbai    82        85
7   5/2/2017    mumbai    81        78
8   5/1/2017   beijing    80        26
9   5/1/2017   beijing    77        30
10  5/2/2017   beijing    79        35
11  5/2/2017   beijing    86        78

In [7]:
import numpy as np
#aggregate: count number of entries per day and city 
d=pd.pivot_table(df,index='Date',columns='city',aggfunc='count')
d

         humidity                    temp
city      beijing mumbai new york beijing mumbai new york
Date
5/1/2017        2      2        2       2      2        2
5/2/2017        2      2        2       2      2        2

In [8]:
#same, but summing over days
d=pd.pivot_table(df,index='Date',columns='city',aggfunc='sum')
d

         humidity                    temp
city      beijing mumbai new york beijing mumbai new york
Date
5/1/2017       56    163      114     157    153      131
5/2/2017      113    163      110     165    163      137

In [9]:
#mean
d=pd.pivot_table(df,index='Date',columns='city',aggfunc='mean')
d

         humidity                    temp
city      beijing mumbai new york beijing mumbai new york
Date
5/1/2017     28.0   81.5     57.0    78.5   76.5     65.5
5/2/2017     56.5   81.5     55.0    82.5   81.5     68.5

In [10]:
#max
d=pd.pivot_table(df,index='Date',columns='city',aggfunc='max')
d

         humidity                    temp
city      beijing mumbai new york beijing mumbai new york
Date
5/1/2017       30     83       58      80     78       66
5/2/2017       78     85       60      86     82       69

In [11]:
#transform date format
df['Date']=pd.to_datetime(df['Date'])
df

         Date      city  temp  humidity
0  2017-05-01  new york    65        56
1  2017-05-01  new york    66        58
2  2017-05-02  new york    68        60
3  2017-05-02  new york    69        50
4  2017-05-01    mumbai    75        80
5  2017-05-01    mumbai    78        83
6  2017-05-02    mumbai    82        85
7  2017-05-02    mumbai    81        78
8  2017-05-01   beijing    80        26
9  2017-05-01   beijing    77        30
10 2017-05-02   beijing    79        35
11 2017-05-02   beijing    86        78

In [12]:
#group by date
df.pivot_table(index=pd.Grouper(key='Date'),columns='city')

           humidity                    temp
city        beijing mumbai new york beijing mumbai new york
Date
2017-05-01     28.0   81.5     57.0    78.5   76.5     65.5
2017-05-02     56.5   81.5     55.0    82.5   81.5     68.5

## Reshaping Dataframes 
Using *melt* to perform "inverse" pivot operations.

In [13]:
import pandas as pd

In [14]:
mydis={
    'Day':['Mon','Tue','Wed','Thu','Fri','Sat','Sun'],
    'Kolkata':[10,20,30,40,32,34,23],
    'Kerala':[23,32,13,42,13,43,23],
    'Mumbai':[10,20,30,40,32,34,23]
}
df=pd.DataFrame(mydis)
df

   Day  Kolkata  Kerala  Mumbai
0  Mon       10      23      10
1  Tue       20      32      20
2  Wed       30      13      30
3  Thu       40      42      40
4  Fri       32      13      32
5  Sat       34      43      34
6  Sun       23      23      23

In [15]:
df2=pd.melt(df,id_vars=['Day'],var_name='City',value_name='Temp')
df2

    Day     City  Temp
0   Mon  Kolkata    10
1   Tue  Kolkata    20
2   Wed  Kolkata    30
3   Thu  Kolkata    40
4   Fri  Kolkata    32
5   Sat  Kolkata    34
6   Sun  Kolkata    23
7   Mon   Kerala    23
8   Tue   Kerala    32
9   Wed   Kerala    13
10  Thu   Kerala    42
11  Fri   Kerala    13
12  Sat   Kerala    43
13  Sun   Kerala    23
14  Mon   Mumbai    10
15  Tue   Mumbai    20
16  Wed   Mumbai    30
17  Thu   Mumbai    40
18  Fri   Mumbai    32
19  Sat   Mumbai    34
20  Sun   Mumbai    23